[
  {
    "type": "Dev Tools",
    "links": {
      "github": "https://github.com/williamowen65/project-setup"
    },
    "meta": {
      "description": "The magic of this is brought down to only a few lines of code. It just goes to show you how we are playing with fire. Simply manage a folder of project-boiler-plates and use the built-in CLI tool to print projects to any folder on your machine. The logic recursively looks at folder names and Yargs.js helps to bring it to the CLI. This solution provides a 100% customizable experience, unlike prepackaged framework generators like create-react-app. This is still in maintenance at the moment, but it is very usable already.",
      "title": "A simple way to generate customized boiler-plate code"
    }
  },
  {
    "type": "Open Source",
    "links": {
      "github": "www.wowebdev.com"
    },
    "meta": {
      "title": "Chronos",
      "description": "Chronos sdfsdf"
    }
  },
  {
    "type": "Open Source",
    "links": {
      "github": "www.wowebdev.com"
    },
    "meta": {
      "title": "Extra",
      "description": "None yet, but soon (etc)"
    }
  },
  {
    "type": "Freelance",
    "links": {
      "medium": "https://medium.com/@william.owen.dev/excel-diary-for-tracking-health-fitness-freelance-da84fc743fe4"
    },
    "meta": {
      "title": "Excel Diary for tracking health & fitness",
      "description": "A custom built Google sheet with a JavaScript automated product-creation experience for my client.  This product duplicates a template layout, including all of the hidden functionality, and creates a whole new spreadsheet which can be shared with clients, leaving the template to be reused. I used the Google App Script API to navigate manipulating the document and also added to the menu of the sheet. Follow my link to the medium article and you can set up with your own automated diary and learn about how it works."
    }
  },
  {
    "type": "Freelance",
    "links": {
      "github": "www.wowebdev.com"
    },
    "meta": {
      "title": "Read Voices (Website)",
      "description": "This website functions as a hub for an author with content dispersed across the internet. I based this app on the layout and functionality of WordPress. When you're logged in, you have a dashboard, and editing of content happens directly in the site interface, with a dynamic WYSIWYG editor."
    }
  },
  {
    "type": "Freelance",
    "links": {
      "medium": "www.wowebdev.com"
    },
    "meta": {
      "title": "Google Sheet for Tracking Expenses",
      "description": "This product provides invoicing orders, tracking inventory, managing costs and sale prices, and overall understanding the data as a whole. It is built with JavaScript via Google AppScripts. "
    }
  },
  {
    "type": "Freelance",
    "links": {
      "github": "www.wowebdev.com"
    },
    "meta": {
      "title": "A Newsletter SignUp App",
      "description": "This custom application was built with React Native. The problem I solved for this client was manual entry of data. It was a gap in her workflow that I knew could be automated. React Native was chosen because the target was an android tablet that could be brought to art shows and used in a booth to sign people up for newsletters. Her workflow was integrated with other websites, which is what prompted me to use Puppeteer.js! Puppeteer is handled on a remote server. Overall, the app has a custom look and puts user experience first. "
    }
  }
]